benchmarks/eplb_rebalance/results/eplb_decode_heavy_optimized_20260904/phased/00_async_off/bench.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0bc0a159e0>, trust_remote_code=False, seed=0, num_prompts=256, dataset_name='custom', no_stream=False, dataset_path='benchmarks/eplb_rebalance/bench_dataset/eplb_phased_english_256.jsonl', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=300, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='Qwen/Qwen3-30B-A3B-Instruct-2507', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/cc/benchmarks/eplb_decode_heavy_optimized_20260904/phased/00_async_off', result_filename='bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-ee8eee20-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  1900.04   
Total input tokens:                      96312     
Total generated tokens:                  76800     
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         40.42     
Peak output token throughput (tok/s):    96.00     
Peak concurrent requests:                50.00     
Total token throughput (tok/s):          91.11     
---------------Time to First Token----------------
Mean TTFT (ms):                          36522.62  
Median TTFT (ms):                        40638.24  
P50 TTFT (ms):                           40638.24  
P90 TTFT (ms):                           54741.71  
P95 TTFT (ms):                           55034.85  
P99 TTFT (ms):                           61215.13  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          671.91    
Median TPOT (ms):                        672.59    
P50 TPOT (ms):                           672.59    
P90 TPOT (ms):                           726.77    
P95 TPOT (ms):                           732.26    
P99 TPOT (ms):                           784.28    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          237424.62 
Median E2EL (ms):                        238039.94 
P50 E2EL (ms):                           238039.94 
P90 E2EL (ms):                           244139.48 
P95 E2EL (ms):                           244256.75 
P99 E2EL (ms):                           244282.08 
==================================================